import React from "react";

const About: React.FC = () => {
	return (
		<article
			style={{
				marginTop: "80px",
				padding: "10px",
				direction: "rtl",
				lineHeight: "25px"
			}}
		>
			<p>
				روابط مفيدة : <a href="#team">الفريق</a> -
				<a href="tech"> الجانب الفني </a> -{" "}
				<a href="#prive">الخصوصية</a> - <a href="#notes">حساب المعدل</a>
			</p>
			<h1 style={{ margin: "10px", direction: "ltr" }}>RafiQi</h1>
			<p>
				هو مشروع تعليمي بسيط بدأ كمشروع او أداة لحساب المعدل الدراسي
				بهدف التعلم، حيث كان يود المبرمج لهذا الموقع بتجربة مهاراته في{" "}
				<em>JavaScript</em> في شيء معقد وبحكم انه تلميذ هذا ما فكر فيه
				كشيء معقد ومناسب لتجربة فكرته، ثم تطورت الفكرة لتشمل فكرة مساعدة
				الطالب على حياته الدراسية، رغم ان المشروع بسيط وتتم اضافة مميزات
				كل مرة الا ان هدفه الرئيسي والاول مساعدة الطالب والتلميذ على
				دراسته بافضل شكل ممكن، ضل المشروع حيا لانه يعتبر قطعة ممتازة
				للمطور بتجربة ما يتعلمه وكان معه دائما، حيث يجرب اي اداة واي
				مهارة واي شي جديد يتعمله في مجال <em>الويب</em> في هذا المشروع،
				حيث بدأ المشروع بالنسخة الاولى تحت عنوان vanilla RafiQi لانه
				يستخدم Vanilla Web حيث بدأ فقط ك <em>html</em> و <em>css</em> و{" "}
				<em>JavaScript</em> ثم تطور الى النسخة الثانية او الاصدار الثاني
				حيث شمل <em>MERN stack</em> حيث طبق تقنياته فيه ...{" "}
				<a href="#tech">الجانب التقني</a>
				<br />
				لازال المشروع بيئة ممتازة للمطور لهذا الغرض ويعتبر مشروعا ممتازا
				كذلك للمستخدم العادي، بحكم ان المستخدم مغربي، حيث ان الموقع موجه
				ومبرمج تحديدا ليتناسب معه، وهذا ما يتميز به المشروع عن باقي
				المنصات التعليمية الاخرى، نحاول ما امكن توفير بيئة مناسبة
				للمستخدم وتحسين تجربته، مع حرصنا على الشفافية و
				<a href="#prive">الخصوصية</a> التامة، كما ان المشروع مفتوح
				المصدر ما يؤكد كلامنا في هاذا الأمر، يتوفر المشروع على الة حاسبة
				لمعدل مع قسم خاص للمنشورات التي تمكن المستخدم من نشر منشورات
				تعليمية ومفيدة حيث يستفيد منها كذلك بقية من يستخدمون هذا الموقع،
				ويمكن كذلك من انشاء <em>فلاش كادرز</em> للتعلم والحفظ السريع،
				الخصائص الاخيرة هاته تحتاج تسجيل دخول، موقعنا يتميز بخدمة تسجل
				دخول سريعة وامنة، يمكنك زيارة <a href="#prive">الخصوصية </a>{" "}
				لذلك ،
			</p>
			<h2 style={{ margin: "10px" }} id="notes">
				حساب المعدل
			</h2>
			<p>
				بدون مقدمات اذا رغبت في الكود المباشر والذي يحسب المعدل لتحقق
				يمكن الاطلاع على الكود المصدر والبحث عن ملف باسم calculator.tsx
				ان شرح كيفية حساب المعدل لكل مستوى على حدة والمعاملات والمواد
				والخ ... امر غير فعال في صفحة واحدة فقط !
			</p>
			<h2 style={{ margin: "10px" }} id="team">
				الفريق
			</h2>
			<p>
				الفريق نوعا ما او بشكل او بأخر هو شخص واحد يتعلم البرمجة في صمت،
				علم نفسه بنفسه، بدون اي رفيق او مساعد ، لا توجد معلومات اخرى
				متوفرة !
			</p>
			<h2 style={{ margin: "10px" }} id="tech">
				الجانب الفني
			</h2>
			<p>
				المشروع مشروع مفتوح المصدر على{" "}
				<a href="https://github.com/antyscript/RafiQi">Github</a> ويمكن
				لاي شخص الاطلاع على الكود المصدر وهو تحت رخصة خاصة تسمح باعادة
				استخدام الكود المصدر من اجل التعلم والمساهمة المستقبلية في
				المشروع الاساسي ومن اجل ضمان الشفافية والثقة للمستخدم، ولا يسمح
				باستخدام الكود باي شكل من الاشكال لاجل غرض تجاري او شخصي بحت دون
				اطار المسموح به، المشروع في نسخته السابقة استخدم مزيجا بين{" "}
				<em>ReactJS, MDB, NodeJS(ExpressJS)</em>
				{
					" يمكنك الاطلاع على الفاصيل في ملف README.md في مستودع المشروع اذا كنت مهتما، لانه لن يتم ذكر جميع التقنيات هنا"
				}
				اما في هاته النسخة فيستخدم <em>NextJS, TS, PSQL</em> اذا لم تفهم
				هاته المصطلحات لا داعي لفهمها ، مجرد مصطلحات تشير الى كيفية عمل
				التطبيق، ولن اشرح اي مصطلح واحد، في ما يلي الادوات التي استخدمها
				: <em> Termux (npm, git ...), Acode, web dev tools, Chrome </em>
				ابرمج من الهاتف "حرفيا" ليس لدي حاسوب واكتفيت بالهاتف اغلب
				المشاكل التي تحتاج الى هذا الاخير تم حلها بواسطة هاته التطبيقات
				ويمكنني انشاء وتطوير هذا المشروع من اجلكم ومن اجلي
			</p>
			<h2 style={{ margin: "10px" }} id="prive">
				الخصوصية
			</h2>
			<p>
				على الرغم من ان بياناتك امنة ولا نشاركها مع اي طرف ثالث الا اننا
				نوصي بشدة كبيرة بعدم ادخال اي معلومات قد تسبب ضررا، نحن لسنا
				مسؤولين عن اي استخدام غبي او وقوع في فخ الهندسة الإجتماعية، نوصي
				بشدة بعدم تجنب ادخال كلممة مرور ضعيفة او مكررة كالذي يستخدم نفس
				كلمة مروره في جميع حساباته، يفضل التسجيل باسماء وهمية وفي نفس
				الوقت مقبولة لضمان امان واحتياط كبيرين، يتم تخزين معلوماتك بشكل
				امن، ولا نشاركها اطلاقا ولا نستخدمها لاي غرض خارج المشروع كيفما
				كان، الشفافية والخصوصية هي من اولويتنا وتجربة المستخدم هي غايتنا
				الاولى
			</p>
			<hr style={{ margin: "10px" }} />
			<p>
				كتبنا هذا المقال بالعربية لاهميته، بقية الموقع ؟ تحتاج ان تتعود
				على الفرنسية، بل هذا افضل لك ، اذا لم يكن اي قسم هنا او اي جزء
				من الموقع مفهوما او ترغب في الإبلاغ بشيء او اضافة شيء يفضل
				التواصل معنا واعلانا بذلك !
			</p>
		</article>
	);
};

export default About;
